---
kind: type
id: T:Autodesk.Revit.DB.ParameterFilterRuleFactory
source: html/317755a4-24ba-9f36-7639-f6fb2aa5a1a7.htm
---
# Autodesk.Revit.DB.ParameterFilterRuleFactory

Contains functions that create appropriate FilterRule objects based on the parameters given.

## Syntax (C#)
```csharp
public class ParameterFilterRuleFactory : IDisposable
```